<?php

return [
    'status' => [
        'not_paid' => 'تراکنش ناموفق بوده یا توسط کاربر لغو شده است.',
        'unexpected' => 'یک خطای غیرمنتظره در پرداخت به وجود آمده است. لطفاً مدیریت را مطلع نمایید.',

        'incomplete_data' => 'اطلاعات ارسال شده ناقص است.',
        'wrong_ip_or_merchant_id' => 'IP یا مرچنت کد پذیرنده صحیح نیست.',
        'shaparak_limited' => 'با توجه به محدودیت‌های شاپرک، امکان پرداخت با رقم درخواست شده میسر نمی‌باشد.',
        'insufficient_user_level' => 'سطح تایید پذیرنده پایین تر از سطح نقره‌ای است.',
        'request_not_found' => 'درخواست مورد نظر یافت نشد.',
        'unable_to_edit_request' => 'امکان ویرایش درخواست میسر نمی‌باشد.',
        'no_financial_operation' => 'هیچ نوع عملیات مالی برای این تراکنش یافت نشد.',
        'failed_transaction' => 'تراکنش ناموفق می‌باشد.',
        'amounts_not_equal' => 'رقم تراکنش با رقم پرداخت شده مطابقت ندارد.',
        'transaction_splitting_limited' => 'سقف تقسیم تراکنش از لحاظ تعداد یا رقم عبور نموده است.',
        'method_access_denied' => 'اجازه دسترسی به متد مربوطه وجود ندارد.',
        'invalid_additional_data' => 'اطلاعات ارسال شده مربوط به AdditionalData غیرمعتبر می‌باشد.',
        'invalid_expiration_range' => 'مدت زمان معتبر طول عمر شناسه پرداخت باید بین ۳۰ دقیقه تا ۴۵ روز باشد.',
        'request_archived' => 'درخواست مورد نظر آرشیو شده است.',
        'operation_succeed' => 'عملیات با موفقیت انجام شد.',
        'already_verified' => 'عملیات پرداخت موفق بوده و قبلاً تایید صحت تراکنش آن انجام شده است.',
    ],
];
